# Exercício - Mini Projeto de Análise de Dados

Vamos fazer um exercício completo de pandas para um miniprojeto de análise de dados.

Esse exercício vai obrigar a gente a usar boa parte dos conhecimento de pandas e até de outros módulos que já aprendemos ao longo do curso.

### O que temos?

Temos os dados de 2019 de uma empresa de prestação de serviços. 

- CadastroFuncionarios
- CadastroClientes
- BaseServiçosPrestados

Obs1: Para ler arquivos csv, temos o read_csv<br>
Obs2: Para ler arquivos xlsx (arquivos em excel normais, que não são padrão csv), temos o read_excel

### O que queremos saber/fazer?

1. Valor Total da Folha Salarial -> Qual foi o gasto total com salários de funcionários pela empresa? <br>
    Sugestão: calcule o salário total de cada funcionário, salário + benefícios + impostos, depois some todos os salários
    
    
2. Qual foi o faturamento da empresa?<br>
    Sugestão: calcule o faturamento total de cada serviço e depois some o faturamento de todos
    
    
3. Qual o % de funcionários que já fechou algum contrato?<br>
    Sugestão: na base de serviços temos o funcionário que fechou cada serviço. Mas nem todos os funcionários que a empresa tem já fecharam algum serviço.<br>
    . Na base de funcionários temos uma lista com todos os funcionários<br>
    . Queremos calcular Qtde_Funcionarios_Fecharam_Serviço / Qtde_Funcionários_Totais<br>
    . Para calcular a qtde de funcionários que fecharam algum serviço, use a base de serviços e conte quantos funcionários tem ali. Mas lembre-se, cada funcionário só pode ser contado uma única vez.<br><br>
    Dica: se você aplicar o método .unique() em uma variável que é apenas 1 coluna de um dataframe, ele vai excluir todos os valores duplicados daquela coluna.<br>
    Ex: unicos_colunaA = dataframe['colunaA'].unique() te dá como resposta uma lista com todos os itens da colunaA aparecendo uma única vez. Todos os valores repetidos da colunaA são excluidos da variável unicos_colunaA 
    
    
4. Calcule o total de contratos que cada área da empresa já fechou


5. Calcule o total de funcionários por área


6. Qual o ticket médio mensal (faturamento médio mensal) dos contratos?<br>
    Dica: .mean() calcula a média -> exemplo: media_colunaA = dataframe['colunaA'].mean()

Obs: Lembrando as opções mais usuais de encoding:<br>
encoding='latin1', encoding='ISO-8859-1', encoding='utf-8' ou então encoding='cp1252'

Observação Importante: Se o seu código der um erro na hora de importar os arquivos:<br>
- CadastroClientes.csv
- CadastroFuncionarios.csv

Use separador ";" (ponto e vírgula) para resolver

In [12]:
import pandas as pd

servicos = pd.read_excel("BaseServiçosPrestados.xlsx")
clientes = pd.read_csv("CadastroClientes.csv", sep = ";")
funcionarios = pd.read_csv("CadastroFuncionarios.csv", sep = ";", decimal =",")

display(servicos.head())
display(clientes.head())
display(funcionarios.head())

,Codigo do Servico,ID Funcionário,ID Cliente,Tempo Total de Contrato (Meses),Unnamed: 4,Unnamed: 5
0,OS0001,67,1,14,NaN,NaN
1,OS0002,17,2,12,NaN,NaN
2,OS0003,116,4,14,NaN,NaN
3,OS0004,37,5,8,NaN,NaN
4,OS0005,130,6,8,NaN,NaN

   ID Cliente             Cliente  Valor Contrato Mensal
0           1  Teixeira Gonçalves                    540
1           2        Souza Santos                   1260
2           3        Emídio Alves                   3195
3           4        Santos Costa                   2520
4           5         Do Monteiro                   3510

,ID Funcionário,Estado Civil,Nome Completo,Salario Base,Impostos,Beneficios,VT,VR,Cargo,Area
0,1,C,Gabriel Mesquita,21910,10955.0,4382.0,242,719.04,Diretor,Operações
1,2,C,João Haddad,5404,2702.0,1080.8,154,574.56,Estagiário,Logística
2,3,C,Amanda Marques Ribeiro,16066,8033.0,3213.2,154,729.12,Estagiário,Administrativo
3,4,C,Guilherme Nunez,21305,10652.5,4261.0,220,524.16,Analista,Administrativo
4,5,C,Adelino Gomes,5098,2549.0,1019.6,176,725.76,Analista,Administrativo

# Análise para limpeza de dados

In [2]:
#
print("Servicos infos")
servicos.info()

#Remover 2 colunas vazias do fim

Servicos infos
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237 entries, 0 to 236
Data columns (total 6 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   Codigo do Servico                237 non-null    object
 1   ID Funcionário                   237 non-null    int64
 2   ID Cliente                       237 non-null    int64
 3   Tempo Total de Contrato (Meses)  237 non-null    int64
 4   Unnamed: 4                       0 non-null      float64
 5   Unnamed: 5                       0 non-null      float64
dtypes: float64(2), int64(3), object(1)
memory usage: 11.2+ KB

In [3]:
print("Clientes infos")
clientes.info()

#base limpa já

Clientes infos
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 320 entries, 0 to 319
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ID Cliente             320 non-null    int64
 1   Cliente                320 non-null    object
 2   Valor Contrato Mensal  320 non-null    int64
dtypes: int64(2), object(1)
memory usage: 7.6+ KB

In [4]:
print("Funcionarios infos")
funcionarios.info()

#base já limpa

Funcionarios infos
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 114 entries, 0 to 113
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ID Funcionário  114 non-null    int64
 1   Estado Civil    114 non-null    object
 2   Nome Completo   114 non-null    object
 3   Salario Base    114 non-null    int64
 4   Impostos        114 non-null    float64
 5   Beneficios      114 non-null    float64
 6   VT              114 non-null    int64
 7   VR              114 non-null    float64
 8   Cargo           114 non-null    object
 9   Area            114 non-null    object
dtypes: float64(3), int64(3), object(4)
memory usage: 9.0+ KB

# Limpeza de bases

In [5]:
servicos = servicos.dropna(how="all", axis = 1) #remove todas as colunas completamente vazias

# Folha de pagamento Total

In [6]:
funcionarios["Salario Total"] = funcionarios["Salario Base"]+funcionarios["Impostos"]+ funcionarios["Beneficios"] + funcionarios['VT']+funcionarios["VR"]

folha_salarial_total = funcionarios["Salario Total"].sum()
print("O valor total de pagamento na folha salarial é de R${:_.2f}".format(folha_salarial_total).replace(".",",").replace("_",".")) #formatação para deixar em moeda brasileira

O valor total de pagamento na folha salarial é de R$2.717.493,22

# Faturamento

In [7]:
faturamento = pd.DataFrame()
faturamento = servicos.merge(clientes)
faturamento["Valor Total do Servico"] = faturamento["Tempo Total de Contrato (Meses)"]*faturamento["Valor Contrato Mensal"]
faturamento_total = faturamento["Valor Total do Servico"].sum()
print("O faturamento total foi de R${:_.2f}".format(faturamento_total).replace(".",",").replace("_",".")) #formatação para deixar em moeda brasileira

O faturamento total foi de R$5.519.160,00

# Porcentagem de funcionarios que já fecharam contrato

In [13]:
total_funcionarios = funcionarios["ID Funcionário"].count()
porcentagem = len(servicos["ID Funcionário"].unique())/total_funcionarios
print("O percentual de funcionário que já fecharam um serviço é de {:.2%}%".format(porcentagem) )

O percentual de funcionário que já fecharam um serviço é de 86.84%%

# Contratos por área da empresa

In [9]:
faturamento = faturamento.merge(funcionarios)
contratos_por_area = faturamento["Area"].value_counts()
display(contratos_por_area)

Administrativo    63
Operações         48
Comercial         44
Financeiro        42
Logística         40
Name: Area, dtype: int64

# Funcionários por área

In [10]:
funcionarios_area = funcionarios["Area"].value_counts()
display(funcionarios_area)

Administrativo    26
Comercial         26
Operações         23
Logística         21
Financeiro        18
Name: Area, dtype: int64

# Ticket Médio

In [11]:
ticket_medio = clientes['Valor Contrato Mensal'].mean()
print("Valor médio do contrato é de R${:_.2f}".format(ticket_medio).replace(".",",").replace("_",".")) #formatação para deixar em moeda brasileira

Valor médio do contrato é de R$2.502,56